OdDbBaseDatabasePE.putNamedViewInfo(OdRxObject*,OdDbStub*,OdArray&lt;OdString,OdObjectsAllocator&lt;OdString&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves information about viewports for a specified database and layout.
\params pDb       [in] A pointer to a database.
\params layoutId  [in] A layout identifier.
\params layoutId  [out] An array of viewport names. Filled and returned by the method.
\params layoutId  [out] An array of viewport points. Filled and returned by the method.